{
  "navbar": {
    "home": "Home",
    "about": "About",
    "work": "Work",
    "contact": "Contact"
  },
  "about": {
    "about": "About Me",
    "box1": {
      "heading": "Hi I'm Nuriddinbek Obidjonov",
      "text": "Software professional with 1.5+ year experience, a strong focus on customers, excellent communication abilities, and technical platform competence"
    },
    "box3": {
      "heading": "Time Zone",
      "text": "I'm based in Tashkent, Uzbekistan, and open to remote work worldwide"
    },
    "box4": {
      "heading": "Do you want to start a project together ?",
      "btncopy": "Copy Email Address",
      "btncopied": "Email has been copied"
    },
    "box5": {
      "heading": "Tech Stack",
      "text": "I specialize in variety of languages, frameworks and tools that allows me to build rebust and scalable applications"
    }
  },
  "projects": {
    "readmore": "Learn More",
    "p1": {
      "heading": "Car Rental Platform",
      "info": "A convenient site for renting cars in Dubai, allowing customers to know in advance about the price and all the amenities of the cars and then decide which car to rent",
      "text": {
        "1": "Create a responsive website with a Rest-full API",
        "2": "Implement an Admin panel for secure authentication and changing data by the owner",
        "3": "Developed a responsive frontend with Tailwind CSS, which improves the user experience",
        "4": "Added filters to sort cars by type, price, brand, etc..."
      }
    },
    "p2": {
      "heading": "Home Sales",
      "info": "Sale website for newly made homes, the owner is Atabaey Bahadir that's why website name was also matched to his name",
      "text": {
        "1": "Created with Vite to make it modern and fast",
        "2": "Used i18next to make this platform multilingual and added three languages ​​- English, Russian, Uzbek",
        "3": "Developed a React-based frontend with Tailwind CSS for a sleek user experience"
      }
    },
    "p3": {
      "heading": "Child's Play",
      "info": "Modern simple games for kids and to improve their logical skills",
      "text": {
        "1": "This platform specially created to pass semester exam at University",
        "2": "Added navbar panel which includes information about documentation and author",
        "3": "Live search panel added and made it easy to search for specific game",
        "4": "Developed a fully interactive Single Page Application using JavaScript, CSS3, HTML5",
        "5": "Implemented CSS monthly gridlines and inserted many games",
        "6": "Added Google Dinasour, X or O, Tennis, Drum-kit, Dice Stones"
      }
    },
    "p4": {
      "heading": "Bukhara Factory",
      "info": "Bukhara Fabric - natural products and collection of thousands of materials for sale",
      "text": {
        "1": "Used React JS, Javascript, TailwindCSS, CSS3, HTML5 to make this website",
        "2": "Added AntDesign and Swiper libraries to give smooth animations",
        "3": "Given ability to work with 3 languages ​​and to be easy for all users",
        "4": "Created suggestion to offer most relevant or popular products to clients",
        "5": "Used TailwindCSS to increase this site's SEO and maintain smooth operation"
      }
    },
    "p5": {
      "heading": "HooBank",
      "info": "HooBank is a banking platform which provides all online banking facilities to the users",
      "text": {
        "1": "Specially created to improve web-design knowledge on my own",
        "2": "Developed a responsive theme using HTML5, CSS3, and javascript",
        "3": "Integrated Bootstrap for modern styling and UI enhancements",
        "4": "Optimized SEO and page speed using Bootstrap for fast builds",
        "5": "Implemented custom widgets and plugin compatibility for extended functionality"
      }
    },
    "p6": {
      "heading": "Udevs Developer Company",
      "info": "A web application for personal use of IT-company, it will offer all services of that company",
      "text": {
        "1": "Personal website for Udevs IT company",
        "2": "Created with Vite JS to make it fast and efficient",
        "3": "Added interactive and user-friendly interface to attract and satisfy clients",
        "4": "Used Tailwindcss to give flawless and smooth motion to site and increase its SEO"
      }
    }
  },
  "experiences": {
    "heading": "My Work Experience",
    "text": "I've been working on Front-end Development for the past 2 years. Here's a timeline of my journey",
    "exp1": {
      "1": "- Created a personal portfolio using Three.js, React, Vite, and WebAPI to showcase technical expertise",
      "2": "- Continuously enhancing technical skills and expanding expertise in modern web development and back-end technologies"
    },
    "exp2": {
      "1": "- Efficiently managing team, making sure tasks need be done on time on Trello",
      "2": "- Adding Telegram Bots and EmailJS to websites to provide real time communications with clients",
      "3": "- Using Three.js, antDesign, Swiper, Aos libraries to make sites flexible and smooth for better UX design",
      "4": "- Using i18next libraries effectively to create Multilingual sites",
      "5": "- Building responsive, secure and Rest-full API based websites with Tailwind, .env and React JS",
      "6": "- Enhanced application security and developed new features, adhering to standards set by the Passive Defense Organization and National Cyberspace Center",
      "7": "- Designed and implemented intuitive map interfaces using MapsUI, enhancing user experience and enabling seamless interactive map integration",
      "8": "- Enhanced responsiveness and usability of applications using Windows Forms and WPF frameworks",
      "9": "- Executed XML to SVG conversions using X-DOM, ensuring dynamic and efficient data visualization"
    },
    "exp3": {
      "1": "- Creating sophisticated sites, small size websites and making it exclusively fast",
      "2": "- Making strong algorithm to loose repetition of code and making sites fast and light",
      "3": "- Raising performance and SEO to 90% – 100% and hoisting up sites to the top on Google search",
      "4": "- Engineered systems for large-scale data ingestion and analysis, ensuring efficient data processing and storage",
      "5": "✅ Implemented secure APIs, following ISO 26262 automotive safety standards",
      "6": "✅ Ensured data privacy for customers and partners through industry-compliant protocols",
      "7": "✅ Delivered remote features like over-the-air updates, real-time tracking, and remote start capabilities"
    }
  },
  "testimonials": {
    "heading": "Hear From My Clients",
    "oybek": "I've never seen anything like this before. It's amazing. I love it.",
    "sardorbek": "I don't know what to say. I'm speechless. This is amazing.",
    "navruza": "I'm at a loss for words. This is amazing. I love it.",
    "javohir": "This is hands down the best thing I've experienced. Highly recommend!",
    "zulfiya": "Incredible work! The attention to detail is phenomenal.",
    "rustambek": "This exceeded all my expectations. Absolutely stunning!",
    "muhammadkarim": "Simply breathtaking. The best decision I've made in a while.",
    "shohruz": "So glad I found this. It has changed the game for me."
  },
  "contact": {
    "heading": "Let's Talk",
    "text": "Whether you are looking to build a new website, improve your existing platform, or bring a unique project to life, I'm here to help",
    "form": {
      "inputname": "Full Name",
      "inputemail": "Email",
      "inputmessege": "Messege",
      "placeholder": "Share your thoughts...",
      "btnsend": "Send",
      "btnsending": "Sending"
    }
  },
  "footer": {
    "1": "Terms & Conditions",
    "2": "Privacy Policy",
    "3": "© 2025 Nuriddinbek. All rights reserved."
  }
}
