{
  "navbar": {
    "home": "Asosiy",
    "about": "Men Haqimda",
    "work": "Tajriba",
    "contact": "Aloqa"
  },
  "about": {
    "about": "Men Haqimda",
    "box1": {
      "heading": "Salom, men Nuriddinbek Obidjonov",
      "text": "1,5 yildan ortiq tajribaga ega bo'lgan, mijozlarga katta e'tibor qaratgan, mukammal aloqa qobiliyatlari va texnik platforma malakasiga ega dasturiy ta'minot bo'yicha mutaxassis"
    },
    "box3": {
      "heading": "Vaqt Zonasi",
      "text": "Men Toshkentda yashayman va butun dunyo bo'ylab masofaviy ishlashga ochiqman"
    },
    "box4": {
      "heading": "Birga proyekt boshlashni hohlaysizmi ?",
      "btncopy": "Emailni Nusxalash",
      "btncopied": "Email Nusxalandi"
    },
    "box5": {
      "heading": "Texnik Qobiliyat",
      "text": "Men kuchli va kengaytiriladigan ilovalarni yaratuvchi turli dasturlash tillari, kutubxonalarga ixtisoslashganman"
    }
  },
  "projects": {
    "readmore": "Ko'proq Ko'rish",
    "p1": {
      "heading": "Ijaraga Avtomobil Platformasi",
      "info": "Dubayda avtoulovlarni ijaraga olish uchun qulay sayt, mijozlarga avtomobillarning narxi va barcha qulayliklari haqida oldindan bilishga imkon beradi va shundan keyin qaysi mashinani ijaraga olish kerakligini hal qiladi",
      "text": {
        "1": "Rest-full API bilan sezgir veb-sayt yaratish",
        "2": "Xavfsiz autentifikatsiya qilish va egasi tomonidan ma'lumotlarni o'zgartirish uchun Administrator panelini joriy qilish",
        "3": "Tailwind CSS bilan sezgir frontendni ishlab chiqdi, bu foydalanuvchi tajribasini yaxshilaydi",
        "4": "Avtomobillarni turlari, narxi, markasi va boshqalar bo'yicha saralash uchun filtrlar qo'shildi..."
      }
    },
    "p2": {
      "heading": "Uy-joy Savdosi",
      "info": "Sale website for newly made homes, the owner is Atabaey Bahadir that's why website name was also matched to his name",
      "text": {
        "1": "Created with Vite to make it modern and fast",
        "2": "Used i18next to make this platform multilingual and added three languages - english, russian, uzbek",
        "3": "Developed a React-based frontend with Tailwind CSS for a sleek user experience"
      }
    },
    "p3": {
      "heading": "Bolalar O'yini",
      "info": "Modern simple games for kids and to improve their logical skills",
      "text": {
        "1": "This platform specially created to pass semester exam at University",
        "2": "Added navbar panel which includes information about documantation and auther",
        "3": "Live search panel added and made it easy to search for specific game",
        "4": "Developed a fully interactive Single Page Application using JavaScript, CSS3, HTML5",
        "5": "Implemented CSS mensary gridlines and inserted many games",
        "6": "Added Google Dinasour, X or O, Tennis, Drum-kit, Dice Stones"
      }
    },
    "p4": {
      "heading": "Buxoro Fabrikasi",
      "info": "Bukhara Fabric - natural products and collection of thousands of materials for sale",
      "text": {
        "1": "Used React JS, Javascript, TailwindCSS, CSS3, HTML5 to make this website",
        "2": "Added AntDesign and Swiper libraries to give smooth animations",
        "3": "Given ability to work with 3 languages and to be easy for all users",
        "4": "Created suggestion to offer most relevant or popular products to clients",
        "5": "Used TailwindCSS to increase this site's SEO and maintain smooth operation"
      }
    },
    "p5": {
      "heading": "HooBank",
      "info": "HooBank is a bank platform which give all online banking facilities to the users",
      "text": {
        "1": "Specially created to improve web-design knowledge on my own",
        "2": "Developed a responsive theme using HTML5, CSS3, and JavaScript",
        "3": "Integrated Bootstrap for modern styling and UI enhancements",
        "4": "Optimized SEO and page speed using Bootstrap for fast builds",
        "5": "Implemented custom widgets and plugin compatibility for extended functionality"
      }
    },
    "p6": {
      "heading": "Udevs Dasturchi Kompaniya",
      "info": "A web application for personal use of IT-company, it will offer all services of that company",
      "text": {
        "1": "Personal website for Udevs IT company",
        "2": "Created with Vite JS to make it fast and effecient",
        "3": "Added interactive and user-friendly interface to attracte satisfy clients",
        "4": "Used Tailwindcss to give flawless and smooth motion to site and increase its SEO"
      }
    }
  },
  "experiences": {
    "heading": "Mening ish tajribam",
    "text": "Men oxirgi 2 yil davomida Front-end Development ustida ishlayapman. Mana mening sayohatimning xronologiyasi",
    "exp1": {
      "1": "- Texnik tajribani namoyish qilish uchun Three.js, React, Vite va WebAPI yordamida shaxsiy portfel yaratildi",
      "2": "- Texnik ko'nikmalarni doimiy ravishda oshirish va zamonaviy veb-ishlab chiqish va back-end texnologiyalari bo'yicha tajribani kengaytirish"
    },
    "exp2": {
      "1": "- Jamoani samarali boshqarish, Trelloda vazifalar o'z vaqtida bajarilishi kerakligiga ishonch hosil qilish",
      "2": "- Mijozlar bilan real vaqt rejimida aloqani ta'minlash uchun veb-saytlarga Telegram botlari va EmailJS qo'shish",
      "3": "- UX dizaynini yaxshilash uchun saytlarni moslashuvchan va silliq qilish uchun Three.js, antDesign, Swiper, Aos kutubxonalaridan foydalanish",
      "4": "- Ko'p tilli saytlarni yaratish uchun i18next kutubxonalaridan samarali foydalanish",
      "5": "- Tailwind, .env va React JS bilan sezgir, xavfsiz va Rest-full API asosidagi veb-saytlarni yaratish",
      "6": "- Passiv mudofaa tashkiloti va Milliy kiberkosmos markazi tomonidan o'rnatilgan standartlarga rioya qilgan holda, ilova xavfsizligi yaxshilandi va yangi xususiyatlar ishlab chiqildi",
      "7": "- MapsUI-dan foydalangan holda intuitiv xarita interfeyslari ishlab chiqilgan va amalga oshirilgan, foydalanuvchi tajribasini yaxshilaydi va xaritaning uzluksiz interaktiv integratsiyasini ta'minlaydi",
      "8": "- Windows Forms va WPF ramkalaridan foydalangan holda ilovalarning sezgirligi va qulayligi yaxshilandi",
      "9": "- X-DOM yordamida XML-dan SVG-ga konvertatsiya qilindi, bu dinamik va samarali ma'lumotlar vizualizatsiyasini ta'minlaydi"
    },
    "exp3": {
      "1": "- Murakkab saytlar, kichik o'lchamli veb-saytlar yaratish va uni faqat tez qilish",
      "2": "- Kod takrorlanishini yo'qotish uchun kuchli algoritm yaratish va saytlarni tez va engil qilish",
      "3": "- Samaradorlik va SEOni 90% - 100% gacha oshirish va Google qidiruvida saytlarni yuqoriga ko'tarish",
      "4": "- keng ko'lamli ma'lumotlarni qabul qilish va tahlil qilish uchun ishlab chiqilgan tizimlar, ma'lumotlarni samarali qayta ishlash va saqlashni ta'minlaydi",
      "5": "✅ ISO 26262 avtomobil xavfsizligi standartlariga rioya qilgan holda xavfsiz API joriy etildi",
      "6": "✅ Sanoatga mos protokollar orqali mijozlar va hamkorlar uchun ma'lumotlar maxfiyligi ta'minlandi",
      "7": "✅ Havodan yangilanishlar, real vaqtda kuzatish va masofadan ishga tushirish imkoniyatlari kabi masofaviy xususiyatlar taqdim etildi"
    }
  },
  "testimonials": {
    "heading": "Mening mijozlarimning sharhlari",
    "oybek": "Men hech qachon bunday narsani ko'rmaganman. Bu ajoyib. Men uni yaxshi ko'raman.",
    "sardorbek": "Nima deyishni bilmayman. Gapirdim. Bu ajoyib.",
    "navro'za": "Men so'zni bilmay qoldim. Bu ajoyib. Men buni yaxshi ko'raman.",
    "javohir": "Bu men boshdan kechirgan eng yaxshi narsa. Tavsiya qilaman!",
    "zulfiya": "Ajoyib ish! Tafsilotlarga e'tibor ajoyib.",
    "rustambek": "Bu barcha kutganlarimdan oshib ketdi. Mutlaqo ajoyib!",
    "muhammadkarim": "Shunchaki hayratlanarli. Bir muncha vaqt ichida qilgan eng yaxshi qarorim.",
    "shohruz": "Buni topganimdan xursandman. Bu men uchun o'yinni o'zgartirdi."
  },
  "contact": {
    "heading": "Menga Yozing",
    "text": "Yangi veb-sayt yaratmoqchimisiz, mavjud platformangizni yaxshilamoqchimisiz yoki noyob loyihani hayotga tatbiq qilmoqchimisiz, men yordam berish uchun shu yerdaman",
    "form": {
      "inputname": "To'liq Ism",
      "inputemail": "Eloktron Pochta",
      "inputmessege": "Xabar",
      "placeholder": "Fikrlaringizni bo'lishing...",
      "btnsend": "Jo'natish",
      "btnsending": "Jo'natilyapti"
    }
  },
  "footer": {
    "1": "Shartlar va Majburiyatlar",
    "2": "Maxfiylik Siyosati",
    "3": "© 2025 Nuriddinbek. Barcha huquqlar himoyalangan."
  }
}
