{
  "navbar": {
    "home": "Asosiy",
    "about": "Men Haqimda",
    "work": "Tajriba",
    "contact": "Aloqa"
  },
  "about": {
    "about": "Men Haqimda",
    "box1": {
      "heading": "Salom, men Nuriddinbek Obidjonov",
      "text": "1,5 yildan ortiq tajribaga, mukammal aloqa qobiliyatlari va texnik platforma malakasiga ega dasturiy ta'minot bo'yicha mutaxassisman"
    },
    "box3": {
      "heading": "Vaqt Zonasi",
      "text": "Men Toshkentda yashayman va butun dunyo bo'ylab masofaviy ishlashga ochiqman"
    },
    "box4": {
      "heading": "Birga proyekt boshlashni hohlaysizmi ?",
      "btncopy": "Emailni Nusxalash",
      "btncopied": "Email Nusxalandi"
    },
    "box5": {
      "heading": "Texnik Qobiliyat",
      "text": "Men zamonaviy ilovalarni yaratuvchi turli dasturlash tillari va kutubxonalarga ixtisoslashganman"
    }
  },
  "projects": {
    "heading": "Mening Tanlangan Proyektlarim",
    "readmore": "Ko'proq Ko'rish",
    "p0": {
      "heading": "Viktorina Ilovasi",
      "info": "U sizning yaqin bilimlaringizni tekshirish uchun yaratilgan va dasturlashning ko'plab sohalari bo'yicha savollar bilan ta'minlangan",
      "text": {
        "1": "Rest-full API bilan sezgir veb-sayt yarating",
        "2": "HTML5, CSS, JS, mavjudlik haqida savollar qo'shing",
        "3": "CSS bilan javob beruvchi frontend ishlab chiqildi",
        "4": "React-Router-Dom bilan ko'p sahifali hujjat yaratildi"
      }
    },
    "p1": {
      "heading": "Ijaraga Avtomobil Platformasi",
      "info": "Dubayda avtoulovlarni ijaraga olish uchun qulay sayt, avtomobillarning narxlari va barcha qulayliklari haqida oldindan bilisiz va shundan keyin ijaraga olasiz",
      "text": {
        "1": "Rest-full API bilan sezgir veb-sayt yaratildi",
        "2": "Xavfsiz autentifikatsiya va egasi tomonidan ma'lumotlarni o'zgartirish uchun administrator panelini joriy qilindi",
        "3": "Tailwind CSS bilan qulay frontendni ishlab chiqib, foydalanuvchi tajribasi yaxshilandi",
        "4": "Avtomobil turi, narxi, markasi va boshqalar bo'yicha saralash uchun filtrlar qo'shildi"
      }
    },
    "p2": {
      "heading": "Uy-joy Savdosi",
      "info": "Yangi qurilgan uylar sotiladigan platforma, egasi Otabaey Bahodir, shuning uchun veb-sayt nomi ham uning nomiga moslangan",
      "text": {
        "1": "Zamonaviy va tezkor qilish uchun Vite bilan yaratilgan",
        "2": "Ushbu platformani ko'p tilli qilish uchun i18next ishlatildi va uchta til qo'shildi - ingliz, rus, o'zbek",
        "3": "Foydalanuvchining qulay tajribasi uchun Tailwind CSS bilan React-ga asoslangan frontend ishlab chiqildi"
      }
    },
    "p3": {
      "heading": "Bolalar O'yini",
      "info": "Bolalar uchun zamonaviy va ularning mantiqiy ko'nikmalarini oshiruvchi o'yinlar",
      "text": {
        "1": "Hujjatlashtirish va egasi haqida ma'lumotni o'z ichiga olgan navbar paneli qo'shildi",
        "2": "Jonli qidiruv paneli qo'shildi va muayyan o'yinni qidirishni osonlashtirdi",
        "3": "JavaScript, CSS3, HTML5 yordamida to'liq interaktiv yagona sahifali ilova ishlab chiqildi",
        "4": "CSS mensary gridlines amalga oshirildi va ko'plab o'yinlar kiritildi",
        "5": "Google Dinasour, X yoki O, tennis, barabanlar to'plami, zar toshlari qo'shildi"
      }
    },
    "p4": {
      "heading": "Buxoro Fabrikasi",
      "info": "Buxoro matosi - tabiiy mahsulotlar va minglab materiallar kolleksiyasi sotiladi",
      "text": {
        "1": "Bu proyektda React JS, Javascript, TailwindCSS, CSS3, HTML5 dan foydalanilgan",
        "2": "Bir tekis animatsiyalarni berish uchun AntDesign va Swiper kutubxonalari qo'shildi",
        "3": "3 ta til bilan ishlash va barcha foydalanuvchilar uchun qulay bo'lish qobiliyatiga ega",
        "4": "Mijozlarga eng mos yoki mashhur mahsulotlarni taklif qilida",
        "5": "SEOni oshirish va zamonaviy qilish uchun TailwindCSS ishlatildi"
      }
    },
    "p5": {
      "heading": "HooBank",
      "info": "HooBank - foydalanuvchilarga barcha onlayn bank xizmatlarini taqdim etadigan bank platformasi",
      "text": {
        "1": "Veb-dizayn bilimlarini mustaqil ravishda yaxshilash uchun maxsus yaratilgan",
        "2": "HTML5, CSS3 va JavaScript yordamidan foydalanilgan",
        "3": "Zamonaviy uslublar va foydalanuvchi interfeysini yaxshilash uchun Bootstrap ishlatilgan",
        "4": "SEO va sahifa tezligi optimallashtirilgan",
        "5": "Kengaytirilgan funksionallik uchun maxsus vidjetlar va plagin mosligi joriy etilgan"
      }
    },
    "p6": {
      "heading": "Udevs Dasturchi Kompaniya",
      "info": "IT-kompaniyaning shaxsiy foydalanishi uchun veb-ilova, u kompaniyaning barcha xizmatlarini taklif qiladi",
      "text": {
        "1": "Udevs IT kompaniyasining shaxsiy veb-sayti",
        "2": "Tez va samarali qilish uchun Vite JS bilan yaratilgan",
        "3": "Mijozlarni mamnun qilish uchun interaktiv va qulay interfeys qo'shildi",
        "4": "TailwindCSSdan saytni erkin va silliq harakat qildirish va uning SEO darajasini oshirish uchun foydalanildi"
      }
    },
    "p7": {
      "heading": "Firebase bilan Mening Pulim ilovasi",
      "info": "bu mening pul va daromad boshqarish uchun har bir operatsiyalarni hisoblash uchun emas",
      "text": {
        "1": "firebase firestore bilan yaratilgan",
        "2": "siz faqat sizga ko'rinadigan hisob qaydnomasini va operatsiyalarni yaratishingiz mumkin",
        "3": "haqiqiy vaqtda ma'lumotlarni yangilashni olish mumkin",
        "4": "siz har qanday vaqtda tranzaktsiyalar tarixini qo'shishingiz, o'chirishingiz va o'zgartirishingiz mumkin"
      }
    },
    "p8": {
      "heading": "Anime Vault",
      "info": "Sevimli anime seriyalaringizni tomosha qilish va boshqarish uchun platforma",
      "text": {
        "1": "Keyingi JS xususiyatlari bilan yaratilgan",
        "2": "O'tkazishda anime kartalarini yuklash uchun React-Inscroll-Observer ishlatildi",
        "3": "Tashqi manbadan anime ma'lumotlarini olish uchun Rest-full API amalga oshirildi",
        "4": "Ish vaqti xatolaridan qochish va kod sifatini ta'minlash uchun TypeScript ishlatildi"
      }
    }
  },
  "experiences": {
    "heading": "Mening Ish Tajribam",
    "text": "Men oxirgi 2 yil davomida Front-end Development ustida ishlayapman. Mana mening sayohatimning xronologiyasi",
    "exp1": {
      "1": "Talabalarga Frontendni o'rgatish va ular bilan real loyihalar qurish",
      "2": "Next JS, React JS, JavaScript, Git, GitHub, Restfull API, Tailwind, CSS, HTML va asosiy kompyuter bilimlarini o'rgatish",
      "3": "Katta o'qituvchilardan yangi texnologiyalarni o'rgangan holda bilimimni doimiy ravishda oshirish",
      "4": "Nuriddinbek.uz nomli haqiqiy domen bilan shaxsiy portfel yaratish va uni bosqichma-bosqich yangilab borish, tajriba orttirish, hamda doim Eng Zo'ri bo'lishga harakat qilish"
    },
    "exp2": {
      "1": "- Jamoani samarali boshqarish, Trelloda vazifalar o'z vaqtida bajarilganligiga ishonch hosil qilish",
      "2": "- Mijozlar bilan real vaqt rejimida aloqani ta'minlash uchun veb-saytlarga Telegram botlari va EmailJSni qo'shish",
      "3": "- UX dizaynini yaxshilash, saytlarni moslashuvchan va silliq qilish uchun Three.js, antDesign, Swiper, Aos kutubxonalaridan foydalanish",
      "4": "- Ko'p tilli saytlarni yaratish uchun i18next kutubxonalaridan samarali foydalanish",
      "5": "- Tailwind, .env va React JS bilan xavfsiz va Rest-full API asosidagi veb-saytlarni yaratish",
      "6": "- Passiv Mudofaa Tashkiloti va Milliy Kiberkosmos markazi tomonidan o'rnatilgan standartlarga rioya qilgan holda, ilova xavfsizligi yaxshilash va yangi xususiyatlar ishlab chiqish",
      "7": "- MapsUI-dan foydalangan holda intuitiv xarita interfeyslari ishlab chiqish, foydalanuvchi tajribasini yaxshilash va xaritaning uzluksiz interaktiv integratsiyasini ta'minlash",
      "8": "- Windows Forms va WPF ramkalaridan foydalangan holda ilovalarning sezgirligi va qulayligi yaxshilash",
      "9": "- X-DOM yordamida XML-dan SVG-ga konvertatsiya qilish, va bu orqali dinamik va samarali ma'lumotlar vizualizatsiyasini ta'minlash"
    },
    "exp3": {
      "1": "- Murakkab saytlar, kichik o'lchamli veb-saytlar yaratish va ularni tezigini oshirish",
      "2": "- Kod takrorlanishini yo'qotish uchun kuchli algoritm yaratish, saytlarni tez va yengil qilish",
      "3": "- Samaradorlik va SEOni 90%dan yuqoriga oshirish va Google qidiruvida saytlarni yuqoriga ko'tarish",
      "4": "- Keng ko'lamli ma'lumotlarni qabul qilish va tahlil qilish uchun tizimlar ishlab chiqish, ma'lumotlarni samarali qayta ishlash va saqlashni ta'minlash",
      "5": "✅ ISO 26262 avtomotiv xavfsizlik standartlariga rioya qilgan holda xavfsiz API joriy etish",
      "6": "✅ Sanoatga mos protokollar orqali mijozlar va hamkorlar uchun ma'lumotlar maxfiyligi ta'minlash",
      "7": "✅ Havodan yangilanishlar, real vaqtda kuzatish va masofadan ishga tushirish imkoniyatlari kabi masofaviy xususiyatlar taqdim etish"
    }
  },
  "testimonials": {
    "heading": "Mijozlarim Sharhlari",
    "oybek": "Men hech qachon bunday mukammal ishni ko'rmaganman. Nuriddinbekni qilgan ishlari menga yoqdi!!!",
    "sardorbek": "Nima deyishni bilmayman 🤗😍. hozirda bizni kompaniya ular yaratgan platformadan foydalanmoqda",
    "navruza": "Biz o'z marketimiz uchun sayt qildirdik va u juda yaxshi ishlamoqda. Menga rossa yoqdi 💖.",
    "javohir": "Bu men tanigan eng yaxshi dasturchi. Tavsiya qilaman!",
    "zulfiya": "Ajoyib ish! Ikir-chikirigacha hamasi zo'r, e'tibor ajoyib 💖.",
    "rustambek": "Mening eng yaxshi va bilimli o'quvchim✊. Doimo yangiliklar yaratadi!!!",
    "muhammadkarim": "Shunchaki super. U qilgan ishlar eng zo'ri 👍.",
    "shohruz": "Tanishganimdan xursandman. Bu bola meni qarorimni o'zgartirdi."
  },
  "contact": {
    "heading": "Menga Yozing",
    "text": "Yangi veb-sayt yaratmoqchimisiz, mavjud platformangizni yaxshilamoqchimisiz yoki noyob loyihani hayotga tatbiq qilmoqchimisiz, men yordam berish uchun shu yerdaman",
    "form": {
      "inputname": "To'liq Ism",
      "inputemail": "Eloktron Pochta",
      "inputmessege": "Xabar",
      "placeholder": "Fikrlaringizni bo'lishing...",
      "btnsend": "Jo'natish",
      "btnsending": "Jo'natilyapti"
    }
  },
  "footer": {
    "1": "Shartlar va Majburiyatlar",
    "2": "Maxfiylik Siyosati",
    "3": "© 2025 Nuriddinbek. Barcha huquqlar himoyalangan."
  }
}
